![merging](cover/11.%20Merging%20Function.png)

#### Outline
- left, right
- on
- how
    -  inner
    -  outter
    - left
    - right
- indicator
- left_index, right_index
- suffixes

### Merging Function
It helps you combine two dataframes by matching the values in common columns

<img src="cover/merging.png" alt="mer" width="500">

#### import library

In [5]:
import pandas as pd

#### Create a two DataFrame

In [6]:
df1 = pd.DataFrame({'ID' : [1, 2, 3, 4],'Class' : ['A', 'B', 'C', 'D']})
df1

   ID Class
0   1     A
1   2     B
2   3     C
3   4     D

In [7]:
df2 = pd.DataFrame({ 'ID': [1, 2, 3, 4], 'Section': ['X1', 'X2', 'X3', 'X4']})
df2

   ID Section
0   1      X1
1   2      X2
2   3      X3
3   4      X4

### Merge the two DataFrame

In [8]:
pd.merge(df1, df2)

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3
3   4     D      X4

In [9]:
pd.merge(df2, df1)

   ID Section Class
0   1      X1     A
1   2      X2     B
2   3      X3     C
3   4      X4     D

### on
We make a common here ID

In [13]:
pd.merge(df1, df2, on='ID')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3
3   4     D      X4

In [15]:
df1

   ID Class
0   1     A
1   2     B
2   3     C
3   4     D

In [16]:
df2

   ID Section
0   1      X1
1   2      X2
2   3      X3
3   4      X4

In [50]:
# pd.merge(df1, df2, on='Class') >> KeyError: 'Class'

### What If we have different Item in ID

In [17]:
df1 = pd.DataFrame({'ID' : [1, 2, 3, 4], 'Class' : ['A', 'B', 'C', 'D']})
df1

   ID Class
0   1     A
1   2     B
2   3     C
3   4     D

In [18]:
df2 = pd.DataFrame({ 'ID': [1, 2, 3, 5], 'Section': ['X1', 'X2', 'X3', 'X4']})
df2

   ID Section
0   1      X1
1   2      X2
2   3      X3
3   5      X4

In [20]:
pd.merge(df1, df2, on='ID')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3

#### how
inner: take common only (by default it's inner)

outer: take all either is common or not

right: it's take only right ID col

left: it's take on left ID col

#### inner

In [23]:
df1

   ID Class
0   1     A
1   2     B
2   3     C
3   4     D

In [24]:
df2

   ID Section
0   1      X1
1   2      X2
2   3      X3
3   5      X4

In [25]:
pd.merge(df1, df2, on = "ID", how = 'inner')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3

#### Outer

In [26]:
pd.merge(df1, df2, on = "ID", how = 'outer')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3
3   4     D     NaN
4   5   NaN      X4

#### Left

In [27]:
pd.merge(df1, df2, on = "ID", how = 'left')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3
3   4     D     NaN

#### right

In [28]:
pd.merge(df1, df2, on = "ID", how = 'right')

   ID Class Section
0   1     A      X1
1   2     B      X2
2   3     C      X3
3   5   NaN      X4

#### Indicator
It tell how file are merge according to 'how' operation

In [30]:
pd.merge(df1, df2, on = "ID", how = 'right', indicator=True)

   ID Class Section      _merge
0   1     A      X1        both
1   2     B      X2        both
2   3     C      X3        both
3   5   NaN      X4  right_only

In [31]:
pd.merge(df1, df2, on = "ID", how = 'outer', indicator=True)

   ID Class Section      _merge
0   1     A      X1        both
1   2     B      X2        both
2   3     C      X3        both
3   4     D     NaN   left_only
4   5   NaN      X4  right_only

#### If we have no item similar in ID column in both dataframes

In [32]:
df1 = pd.DataFrame({'ID' : [1, 2, 3, 4], 'Class' : ['A', 'B', 'C', 'D']})
df1

   ID Class
0   1     A
1   2     B
2   3     C
3   4     D

In [33]:
df2 = pd.DataFrame({ 'ID': [5, 6, 7, 8], 'Section': ['X1', 'X2', 'X3', 'X4']})
df2

   ID Section
0   5      X1
1   6      X2
2   7      X3
3   8      X4

In [42]:
pd.merge(df1, df2, on='ID')

Empty DataFrame
Columns: [ID, Class, Section]
Index: []

#### left index = True right index = True
here it's make a different ID by default it's name ID with _X, _y

In [43]:
pd.merge(df1, df2, left_index = True, right_index = True)

   ID_x Class  ID_y Section
0     1     A     5      X1
1     2     B     6      X2
2     3     C     7      X3
3     4     D     8      X4

#### Suffixes
change the name of column

In [46]:
pd.merge(df1, df2, left_index = True, right_index = True, suffixes=('_1', '_2'))

   ID_1 Class  ID_2 Section
0     1     A     5      X1
1     2     B     6      X2
2     3     C     7      X3
3     4     D     8      X4

### For Source code:
https://sites.google.com/view/aorbtech/programming/

### @Aorb Tech